new Vue({
  el:'#skilldetail',
  data:{
    HTML:"HTML的话标签什么的我觉得自己记忆得还算OK，但是HTML5里面的新特性还在理解当中，特别是canvas,这个既炫酷又好用的东西我会尽快熟练掌握。",
    CSS:"CSS的话一般的样式我也能够掌握，合模型的话自己也理解了，但内核跟阴影动画那边不太掌握，我也一定会花时间来体会的。",
    JS:"(JS这个的话DOM操作我是应该没问题的。)之前我是这样写的，也给了自己的JS80分，但做完这个网页真心发现自己的水平还差得有点远...",
    jQuery:"jQuery这个我正在学，暂时来说的话还没遇到什么困难，嘛，我会继续努力的。",
    PS:"PS...这个，其实我只会一些很简单的处理，，切切图什么的。。。",
    Java:"Java的话我学校有专门的必修课程，在大二学习过了，基本操作应该也没什么问题。",
    Complement:"其他前端技术我也正在争取在最短时间内跟上进度，目前的话正在学习Vue.js框架。剩下的例如react,Argular,Node,啊啊，必须马不停蹄呢~"
  }
});
new Vue({
  el:"#self-assessment",
  data:{
    describe1:"本人是华南农业大学大三在校生一名，专业是计算机科学与技术。",
    describe2:"个性外向乐观，有点二，有点宅，乐于与别人交际沟通，自学能力较强。",
    describe3:"呃...招小斌既没有项目经验也没有工作经验，，说起来实在很是惭愧，，倘若有公司能够不介意这点的话，，我一定会严格要求自己，为能给公司带来利益而不断努力和奋斗！"
  }
});
